# 1.	Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
a, b, c = input('Введите 3х значное число \n')
print(f'Сумма {int(a)+int(b)+int(c)}')
print(f'Произведение {int(a)*int(b)*int(c)}')

