# 1.	Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
a, b, c = input('Введите 3х значное число \n')
print(int(a)+int(b)+int(c))
print(int(a)*int(b)*int(c))
print(int(a)*int(b)*int(c))
