# 3.	По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.
x1, y1 = input('Введите координаты х и у первой точки через пробел:\n').split(' ')
x1 = int(x1)
y1 = int(y1)
print(f'Вы ввели x = {x1} и у = {y1}\n')
x2, y2 = input('Введите координаты х и у второй точки через пробел:\n').split(' ')
x2 = int(x2)
y2 = int(y2)
print(f'Вы ввели x = {x2} и у = {y2}\n')
A = y1 - y2
B = x2 - x1
C = (x1 * y2 - x2 * y1)
if C / B > 0:
    print(f'у={-A / B}x-{C / B}')
else:
    print(f'у={-A / B}x+{-C / B}')
